---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetShapeDrivenAccessor
zh: 钢筋、配筋
source: html/c77085bd-db18-4869-bb2a-1e5c702e273a.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetShapeDrivenAccessor Method

**中文**: 钢筋、配筋

Returns an interface providing access to shape-driven properties and methods for this Rebar element.

## Syntax (C#)
```csharp
public RebarShapeDrivenAccessor GetShapeDrivenAccessor()
```

## Returns
The interface providing access to shape-driven properties and methods for this Rebar element.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This method applies only to shape driven rebar.